Repository: abidiel/trendpro
Catalog: languages/plugins/cf7-to-zapier-*.po
Languages: pt_br

source: Hey! How are you? "CF7 to Webhook" has a built-in feature that detects when a webhook fails and notifies you with this automated email. - Form: [FORM] - Webhook: [WEBHOOK] - Error: [EXCEPTION] Request Method: [REQUEST_METHOD] Request Headers: [REQUEST_HEADERS] Request Body: [REQUEST_BODY] Response Code: [RESPONSE_CODE] Response Message: [RESPONSE_MESSAGE] Response Headers: [RESPONSE_HEADERS] Response Body: [RESPONSE_BODY] -- You'll receive one notification for each webhook with errors. Other webhooks maybe were successful. Please, be careful sharing this data (even in WordPress official support forum). It may contain sensitive data.
pt_br: Olá! Como você está? O plugin "CF7 para Webhook" possui uma funcionalidade que detecta quando um gatilho (webhook) falha e notifica você através desse e-mail automático. - De: [FORM] - Webhook: [WEBHOOK] - Erro: [EXCEPTION] Requisição - Método: [REQUEST_METHOD] Requisição - Cabeçalhos: [REQUEST_HEADERS] Requisição - Corpo: [REQUEST_BODY] Resposta - Código: [RESPONSE_CODE] Resposta - Mensagem: [RESPONSE_MESSAGE] Resposta - Cabeçalhos: [RESPONSE_HEADERS] Resposta - Corpo: [RESPONSE_BODY] -- Você receberá uma notificação para cada webhook com erro. Outros webhooks podem ter funcionado sem problemas. Seja cuidado ao compartilhar dados (mesmo no fórum de suporte do WordPress). Esses dados podem ser sensíveis.

source: Check FAQ from plugin page.
pt_br: Veja as Perguntas Frequentes na página do plugin.

source: How to make multiple webhooks optionals?
pt_br: Como fazer múltiplos webhooks opcionais?

source: Webhook returned a error code.
pt_br: Webhook retornou um código de erro.

source: Webhook has method GET but body is not a JSON to be passed as query params.
pt_br: Webhook foi configurado como GET mas os dados enviados não são um JSON válido para ser passado como parâmetro da URL.

source: [%s] Webhook Error on Form %s
pt_br: [%s] Erro do Webhook no Formulário %s

source: Choose a template
pt_br: Escolha um modelo

source: Continue
pt_br: Continuar

source: Cancel
pt_br: Cancelar

source: Yes
pt_br: Sim

source: No
pt_br: Não

source: Save to load preview.
pt_br: Salve para carregar a previsão.

source: This action will replace "Body" and remove "Special Mail Tags" and "Headers".
pt_br: Essa ação ira substituir o "Corpo" e remover as configurações "Special Mail Tags" e "Cabeçalhos".

source: This action will replace "Headers" and "Body" and remove "Special Mail Tags".
pt_br: Essa ação ira substituir os "Cabeçalhos" e o "Corpo" e remover a configuração "Special Mail Tags".

source: This template has documentation. Want to open (another tab)?
pt_br: Esse modelo possui documentação. Gostaria de lê-la (em outra aba)?

source: Default
pt_br: Padrão

source: ask a question!
pt_br: faça uma pergunta!

source: Or...
pt_br: Ou...

source: You can check more information or search for help.
pt_br: Você pode ver mais informações ou procurar por ajuda.

source: FAQ
pt_br: Perguntas frequentes

source: Send data in your URL.
pt_br: Envie dados para sua URL

source: Help
pt_br: Ajuda

source: <a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/Status" target="_blank">HTTP codes</a> (separated by comma) to be considered success. Other codes will trigger a error notification.
pt_br: <a href="https://developer.mozilla.org/pt-BR/docs/Web/HTTP/Status" target="_blank">Códigos HTTP</a> (separados por vírgula) que são considerados sucesso. Outros códigos irão disparar um e-mail de notificação de erro.

source: Success Codes
pt_br: Códigos de Sucesso

source: One or more emails (separated by comma) to be notified on webhook error.
pt_br: Um ou mais e-mails (separados por vírgula) para serem notificados em caso de falha.

source: Notification
pt_br: Notificação

source: How we handle errors.
pt_br: Como lidamos com erros.

source: Errors
pt_br: Erros

source: We will send your form data as plain/text:
pt_br: Enviaremos os dados do seu formulário como plain/text:

source: Example: %s
pt_br: Exemplo: %s

source: To create your own body, you can replace values like in mail body (case sensitive).
pt_br: Para criar o corpo da sua requisição, você pode substituir tags de e-mail pelos valores (diferencia maiúsculas)

source: REMEMBER:
pt_br: LEMBRE:

source: This can break your integration (check your quotes).
pt_br: Isso pode quebrar sua integração (verifique suas aspas duplas).

source: When you need customize your request.
pt_br: Quando você precisa personalizar sua requisição.

source: Body
pt_br: Corpo

source: When you need authentication/authorization.
pt_br: Quando você precisa de autenticação.

source: Headers
pt_br: Cabeçalhos

source: Choose a HTTP method. In general, you should not change this.
pt_br: Escolha um método HTTP. Em geral, você não deve alterar isso.

source: If you select GET, we will send your data as "query params" (if your body is not a valid JSON we will trigger a error).
pt_br: Se você escolher GET, iremos enviar os dados como "parâmetros de URL" (se o seu corpo não for um JSON válido iremos disparar um erro).

source: BE CAREFUL!
pt_br: TENHA CUIDADO!

source: When you are not making a POST.
pt_br: Quando você não está fazendo um POST.

source: Method
pt_br: Método

source: Advanced settings
pt_br: Configurações avançadas

source: When you need more information.
pt_br: Quando você precisa de mais informação.

source: Check to send file content insted of a link
pt_br: Marque para enviar o conteúdo dos arquivos no lugar da URL

source: Send content
pt_br: Enviar conteúdo

source: Define how you want to send files.
pt_br: Defina como iremos enviar arquivos.

source: Files
pt_br: Arquivos

source: You can choose a template from community to update your header/body settings.
pt_br: Você pode escolher um modelo da comunidade para atualizar as configurações dos cabeçalhos e do corpo.

source: Template
pt_br: Modelo

source: Settings
pt_br: Configurações

source: Use Contact Form 7 as a trigger to any Webhook.
pt_br: Use Contact Form 7 como um gatilho (trigger) para qualquer webhook.

source: You can change field name with webhook config: %s
pt_br: Você pode alterar o nome do campo com a configuração "webhook": %s

source: This is just a example of field names and will not reflect data or customizations.
pt_br: Esse é apenas um exemplo que não leva em consideração os dados ou personalizações.

source: Use this shortcode: [hidden utm_source default:get]
pt_br: Utilize esse shortcode: [hidden utm_source default:get]

source: To get utm_source: https://example.com/?utm_source=example
pt_br: Para conseguir o valor de "utm_source": https://example.com/?utm_source=example

# The URL should point to CF7 documentation.
source: You can add URL parameters using <a href="https://contactform7.com/hidden-field/" target="_blank">Hidden Fields</a> with <a href="https://contactform7.com/getting-default-values-from-the-context/" target="_blank">default values</a> in your form.
pt_br: Você pode adicionar parâmetros da URL usando <a href="https://contactform7.com/hidden-field/" target="_blank">campos escondidos</a> com um <a href="https://contactform7.com/getting-default-values-from-the-context/" target="_blank">valor padrão</a> no seu formulário.

source: URL Params
pt_br: Parâmetros da URL

source: One header by line, separated by colon. Example: %s
pt_br: Um cabeçalho por linha, separados por vírgula. Por exemplo: %s

# The URL should point to HTTP Headers documentation in your language.
source: You can add <a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers" target="_blank">HTTP Headers</a> to your webhook request.
pt_br: Você pode adicionar <a href="https://developer.mozilla.org/pt-BR/docs/Web/HTTP/Headers" target="_blank">Cabeçalhos HTTP</a> à requisição enviada para o webhook.

# The URL should point to CF7 documentation (someday it can be translated).
source: You can add <a href="https://contactform7.com/special-mail-tags/" target="_blank">Special Mail Tags</a> or <a href="https://contactform7.com/selectable-recipient-with-pipes/" target="_blank">labels from selectable with pipes</a> to the data sent to webhook.
pt_br: Você pode adicionar <a href="https://contactform7.com/special-mail-tags/" target="_blank">Special Mail Tags</a> ou <a href="https://contactform7.com/selectable-recipient-with-pipes/" target="_blank">rótulos de seletores com "pipes"</a> aos dados enviados para o webhook.

source: And use placeholders to be replaced by form data: %s
pt_br: E use "placeholder" para serem trocados por dados do formulário: %s

source: You can add multiple webhook: one per line
pt_br: Você pode adicionar múltiplos webhooks: um por linha

source: leave a review
pt_br: deixar uma avaliação

source: make a donation
pt_br: fazer uma doação

source: You can %s or %s.
pt_br: Você pode %s ou %s.

source: Give your support!
pt_br: Dê seu apoio!

source: http://mariovalney.com/me
pt_br: https://mariovalney.com/sobre

source: Send to Webhook
pt_br: Enviar para o Webhook

source: To integrate you should insert your webhook URL below. For example, into Zapier you can create a trigger using "Webhooks" app and choose "Catch Hook" option.
pt_br: Para integrar, você deve adicionar a URL do webhoook abaixo. Por exemplo, no Zapier, você pode criar um gatilho (trigger) escolhendo o app "Webhooks" e a opção "Catch Hook".

source: Or add a second word to pass as key to Webhook: %s
pt_br: Ou adicione uma segunda palavra para enviá-la como nome do campo para o Webhook: %s

source: Insert Special Tags like in mail body: %s
pt_br: Insira as Special Tags como no corpo do e-mail: %s

source: Do it now?
pt_br: Fazer isso agora?

source: You need to install/activate %s Contact Form 7%s plugin to use %s CF7 to Webhook %s
pt_br: Você precisa instalar/ativar o plugin %s Contact Form 7%s para usar o %s CF7 to Webhook %s

source: We will send your form data as JSON:
pt_br: Enviaremos os dados do seu formulário como JSON:

source: Send CF7 mail as usually
pt_br: Enviar o e-mail do CF7 normalmente

source: Send Mail
pt_br: Enviar E-mail

source: You should insert webhook URL here to finish configuration.
pt_br: Você precisa inserir a URL do webhook aqui, para finalizar a configuração.

source: Webhook URL
pt_br: URL do Webhook

source: Integrate
pt_br: Integrar

source: In these options you can activate or deactivate Webhook integration.
pt_br: Nessas opções você pode ativer ou desativar a integração com o Webhook.
